{"importance": "This paper is important because it introduces a novel method for generating synthetic mammogram images with specific radiomics features.  This addresses the critical need for high-quality, diverse training data in medical image analysis, particularly in situations with limited real data due to privacy or cost. The method's ability to generate realistic tumor images with controllable features opens new avenues for improving model development and enhancing treatment planning.", "summary": "RadiomicsFill-Mammo generates realistic mammogram tumor images with desired radiomics features, solving data scarcity issues in medical imaging research.", "takeaways": ["RadiomicsFill-Mammo effectively generates realistic synthetic mammogram tumor images based on various conditions.", "The method improves mass detection in downstream tasks using simulated samples.", "RadiomicsFill-Mammo demonstrates adaptability to small external datasets, enabling broader applications in medical imaging."], "tldr": "Medical imaging often struggles with limited and imbalanced datasets, hindering the development of effective AI models.  Acquiring high-quality data is challenging due to privacy concerns and labeling costs.  Generating synthetic data is one solution, but existing methods often lack the ability to precisely control important biological features. \nThis research introduces RadiomicsFill-Mammo, a novel approach to generate synthetic mammogram images.  It uses radiomics features—low-dimensional yet biologically meaningful markers derived from medical images—to guide the generation process. The study employed a stable diffusion model, incorporating clinical variables like BI-RADS and breast density to create diverse and realistic images. Results indicate that the generated images closely match real mammograms in terms of radiomics features and enhance the performance of downstream tasks like tumor detection.  The availability of code further increases the impact of this method.", "affiliation": "Department of Electrical and Computer Engineering, Sungkyunkwan University", "categories": {"main_category": "Computer Vision", "sub_category": "Image Generation"}}