[{"figure_path": "https://arxiv.org/html/2407.05683/x1.png", "caption": "Figure 1: Overview of the RadiomicsFill-Mammo model, a stable diffusion-based architecture. This model performs iterative denoising for tumor inpainting within masked regions on a noisy latent vector, utilizing information from unmasked regions, the opposite breast, and specific tumor conditions.", "description": "RadiomicsFill-Mammo is a stable diffusion model used for generating synthetic mammogram images containing masses.  The model takes as input a masked mammogram (where the mass area is masked), an image of the opposite breast, and a set of radiomic features and clinical conditions describing the desired mass characteristics (e.g., size, shape, texture, density, BI-RADS score). It iteratively refines a noisy latent representation by incorporating information from both the masked and unmasked regions of the input image, the contralateral breast, and the specified conditions, ultimately generating a realistic synthetic mammogram with a mass that matches the input parameters.", "section": "2 Method"}, {"figure_path": "https://arxiv.org/html/2407.05683/x2.png", "caption": "Figure 2:  Pretraining Process of the Tabular Encoder. Unmasked feature values (i.e., radiomics features) and their embeddings are concatenated for the encoder input. For masked features, a mask token and the masked feature’s embeddings are concatenated, forming the input for the decoder, which focuses on reconstructing tumor conditions. Following pretraining, the encoder is frozen, and its output is utilized for tumor inpainting.", "description": "The figure illustrates the pretraining process for the tabular encoder used in the RadiomicsFill-Mammo model.  The encoder takes both unmasked (radiomics features and their embeddings) and masked (mask token and masked feature embeddings) inputs.  The unmasked inputs are concatenated and fed to the encoder, while the masked inputs are fed to the decoder which attempts to reconstruct the tumor characteristics.  After pretraining, the encoder is frozen and used for tumor inpainting in the main model.  This pretraining process ensures that the encoder learns to represent clinically relevant information from the radiomics features effectively.", "section": "2 Method"}, {"figure_path": "https://arxiv.org/html/2407.05683/x3.png", "caption": "Figure 3: Different Configurations of Prompt Encoders. Each configuration employs a prompt encoder specialized for its prompt type. Configurations (a) MassTextFill, (b) ClinicaltextFill, and (d) RadiomicsFill-MET utilize pretrained and frozen prompt encoders, whereas the encoder for (c) RadiomicsFill-MLP consists of three MLP layers and is trained alongside the generator.", "description": "Figure 3 illustrates four different configurations for encoding prompts used in the RadiomicsFill-Mammo model. Each configuration uses a different type of prompt encoder, specialized for a specific kind of input.  MassTextFill (a) and ClinicalTextFill (b) use simple text-based prompts and pretrained encoders, which are not further trained. RadiomicsFill-MET (d) also uses a pretrained encoder, however, it employs a more sophisticated method (MET) for encoding tabular data that incorporates radiomics features. In contrast, RadiomicsFill-MLP (c) utilizes a multi-layer perceptron (MLP) as its encoder, training this component jointly with the image generation model. The figure highlights the diverse approaches to prompt encoding and shows the design choices made to tailor the model to different types of input data.", "section": "2 Method"}, {"figure_path": "https://arxiv.org/html/2407.05683/x4.png", "caption": "Figure 4:  Radiomics Feature Consistency Between Real and Synthetic Masses. (a) Grouped violin plots for shape, histogram, and texture (GLCM and GLSZM) features, contrasting real (left) and synthetic (right) distributions. (b) Visual comparison of real and synthetic masses, with red arrows highlighting masses and histograms visualizing the 67 extracted radiomics features underneath.", "description": "Figure 4 demonstrates the consistency of radiomics features between real and synthetic mammogram masses generated by RadiomicsFill-Mammo.  Panel (a) uses grouped violin plots to compare the distributions of shape, histogram, gray-level co-occurrence matrix (GLCM), and gray-level size zone matrix (GLSZM) features for real and synthetic masses.  The close similarity of the distributions visually confirms the model's ability to generate realistic radiomics feature values. Panel (b) provides a direct visual comparison of real and synthetic mammogram masses, with red arrows indicating the locations of the masses. Histograms below each image display the values for all 67 extracted radiomics features, further emphasizing the close agreement between real and synthetic data.", "section": "3.1 How Well Does It Generate Diverse and Realistic Tumors?"}, {"figure_path": "https://arxiv.org/html/2407.05683/x5.png", "caption": "Figure 5: Progressive Shape Variation in Synthetic Tumors. Starting with an image containing a mass, we use a normal prompt to replace the mass area with normal tissue. Then, at random positions, we generate synthetic tumors of increasing size, keeping histogram and texture features consistent. Red arrows in each image point to the mass. Below each image, histograms display the radiomics features extracted from the tumor areas.", "description": "This figure demonstrates the ability of the RadiomicsFill-Mammo model to generate synthetic tumors with varying shapes while maintaining consistent histogram and texture features.  The process starts with an image containing a mass, which is replaced with normal tissue using a 'normal' prompt. Then, synthetic tumors of progressively increasing size are generated at random locations within the image.  The red arrows highlight the location of each generated tumor, and the histograms below each image show the radiomics features extracted from the tumor area, demonstrating consistency in texture and histogram features despite varying shapes.", "section": "3.2 How Can RadiomicsFill-Mammo Be Utilized?"}, {"figure_path": "https://arxiv.org/html/2407.05683/x6.png", "caption": "Figure A: Evaluating Framework for the Efficiency of the Pretrained Tabular Encoder. During the training phase, clinical variables were included alongside radiomics features. For evaluation, all clinical variables were masked, and only the 67 radiomics features were fed into the encoder. The encoder’s output, once flattened, served as input for a logistic regression model tasked with a binary classification of BI-RADS into benign and malignant categories. The predictive performance of this model highlights the efficacy of MET in capturing clinically relevant information from radiomics features alone.", "description": "This figure demonstrates the evaluation framework for assessing the pretrained tabular encoder's performance.  The encoder was initially trained with both radiomics and clinical features. However, during evaluation, clinical features were removed, leaving only the 67 radiomics features as input. The encoder's output was then used for binary classification (benign vs. malignant) of BI-RADS assessments via logistic regression.  The accuracy of this classification highlights how effectively the Masked Encoding for Tabular data (MET) method used by the encoder captures clinically relevant information from the radiomics features alone, even without clinical data.", "section": "2.3 Tabular Encoder"}, {"figure_path": "https://arxiv.org/html/2407.05683/x7.png", "caption": "Figure B: Optimizing MET Parameters: AUC Performance Across Masking Rates. This graph tracks AUC scores for benign/malignant predictions at various feature masking rates to determine MET’s optimal parameters. Highlighted in hot pink, the best-performing setup—featuring a 32-dimensional feature embedding, 6 encoder layers, and 3 decoder layers at a 90% masking rate—was chosen as the prompt encoder configuration for RadiomicsFill-MET.", "description": "This figure displays the results of an experiment to find the optimal hyperparameters for the Masked Encoding for Tabular data (MET) model.  The experiment varied the dimensionality of the feature embeddings (4, 8, 16, 32, 64), the number of encoder layers (3, 6), and the number of decoder layers (3, 6).  For each combination of hyperparameters, the model was trained using different feature masking rates (0% to 100%). The area under the curve (AUC) for benign/malignant predictions is plotted against the masking rate for each set of hyperparameters. The combination with the best AUC score at a 90% masking rate—32-dimensional feature embeddings, 6 encoder layers, and 3 decoder layers—is highlighted in hot pink and was selected as the configuration for RadiomicsFill-MET.", "section": "2.3 Tabular Encoder"}, {"figure_path": "https://arxiv.org/html/2407.05683/x8.png", "caption": "Figure C: Cosine Similarity between MET Feature Embeddings. This heatmap visualizes the cosine similarity for MET’s 69 feature-specific embeddings, highlighting strong intra-group correlations within shape, histogram, and texture clusters. The clear block diagonal structure observed signifies the encoder’s proficiency in grouping and differentiating feature categories.", "description": "This heatmap shows the cosine similarity between the 69 individual feature embeddings learned by the Masked Encoding for Tabular data (MET) model.  Each cell represents the cosine similarity between two feature embeddings.  The brighter the color, the higher the similarity.  The heatmap is organized to visually group the features into four main categories: shape (9 features), histogram (18 features), texture (40 features), and clinical (2 features).  The strong diagonal blocks indicate high similarity within each feature category (shape features are similar to each other, histogram features are similar, etc.). The off-diagonal areas show relatively low similarity, demonstrating that the MET model effectively learns distinct representations for different feature categories.", "section": "2.3 Tabular Encoder"}]