[{"content": "| Prompt type | FID ↓ | PSNR ↑ | SSIM ↑ | MS-SSIM ↑ |\n|---|---|---|---|---|\n| MassTextFill | 0.1144 | 32.4783 | 0.8395 | 0.9461 |\n| ClinicalTextFill | 0.0989 | 33.1762 | 0.8430 | 0.9495 |\n| RadiomicsFill-MLP | 0.0874 | 32.7828 | 0.8322 | 0.9498 |\n| RadiomicsFill-MET | **0.0570** | 32.8009 | **0.8535** | **0.9507** |", "caption": "Table 1: Synthetic Tumor Quality Assessment.", "description": "This table presents a quantitative evaluation of the quality of synthetic tumors generated by the RadiomicsFill-Mammo model.  It compares the performance of four different model configurations ('MassTextFill', 'ClinicalTextFill', 'RadiomicsFill-MLP', and 'RadiomicsFill-MET') across four key metrics: Fréchet Inception Distance (FID), Peak Signal-to-Noise Ratio (PSNR), Structural Similarity Index (SSIM), and Multi-Scale Structural Similarity Index (MS-SSIM). Lower FID scores indicate better image quality, while higher PSNR, SSIM, and MS-SSIM scores suggest greater similarity to real tumor images. This table allows for a comparison of the effectiveness of different prompt encoding strategies in generating realistic and high-quality synthetic tumor images.", "section": "3 Results"}, {"content": "| Prompt type | L-B AP | L-M AP | H-B AP | H-M AP | mAP<sub>50</sub> | mAP<sub>50-95</sub> |\n|---|---|---|---|---|---|---|\n| Baseline | 0.7500 | 1.0000 | 0.4907 | 0.5056 | 0.5438 | 0.3569 |\n| MassTextFill-1x | 0.5833 | 0.7500 | 0.4352 | 0.3708 | 0.4378 | 0.2488 |\n| MassTextFill-2x | 0.7778 | 0.8333 | 0.4815 | 0.4045 | 0.4900 | 0.3301 |\n| ClinicalTextFill-1x | 0.5417 | 0.6667 | 0.4047 | 0.2921 | 0.3871 | 0.2245 |\n| ClinicalTextFill-2x | 0.9444 | 1.0000 | 0.5648 | 0.5281 | 0.6006 | 0.3754 |\n| RadiomicsFill-MLP-1x | 0.5833 | 0.8333 | 0.2963 | 0.3708 | 0.3733 | 0.2227 |\n| RadiomicsFill-MLP-2x | 0.8333 | 0.9167 | 0.5648 | 0.5730 | 0.6037 | 0.3784 |\n| RadiomicsFill-MET-1x | 0.5000 | 0.7500 | 0.3796 | 0.4157 | 0.4240 | 0.2550 |\n| RadiomicsFill-MET-2x | **1.0000** | **1.0000** | **0.5648** | **0.6292** | **0.6429** | **0.3935** |", "caption": "Table 2: Mass detection performance on the VinDr-Mammo test set. AP; average precision. mAP; mean AP.", "description": "This table presents the performance of different mass detection models on the VinDr-Mammo test set.  The models are evaluated using average precision (AP) and mean average precision (mAP) metrics for different density and malignancy categories (Low-density benign [L-B], Low-density malignant [L-M], High-density benign [H-B], High-density malignant [H-M]).  The baseline represents the performance of a model trained only on real data, while other rows show results for models using synthetic data generated by different methods, with and without additional real data augmentation. mAP50 and mAP50-95 indicate the mAP calculated using only the top 50 and top 50-95 detections, respectively. This allows for a comparison of the models' abilities to detect masses of different difficulty levels.", "section": "3.2 How Can RadiomicsFill-Mammo Be Utilized?"}, {"content": "| Prompt type | L-B AP | L-M AP | H-B AP | H-M AP | mAP<sub>50</sub> | mAP<sub>50-95</sub> |\n|---|---|---|---|---|---|---|\n| Baseline | 0.3333 | 0.7778 | 0.3846 | 0.2500 | 0.5800 | 0.3978 |\n| MassTextFill | 0.5000 | 0.7778 | 0.6923 | 0.2500 | 0.6800 | 0.4511 |\n| ClinicalTextFill | 0.5000 | 0.7778 | 0.6154 | 0.5000 | 0.6800 | 0.4533 |\n| RadiomicsFill-MLP | **0.6667** | **0.8519** | 0.4615 | 0.5000 | 0.7000 | 0.4689 |\n| RadiomicsFill-MET | 0.5000 | 0.8148 | **0.7692** | **0.5000** | **0.7400** | **0.4711** |", "caption": "Table 3: Mass detection performance on the INbreast dataset.", "description": "Table 3 presents the performance of different mass detection models on the INbreast dataset.  The models tested include a baseline model trained only on real data, and several versions of the RadiomicsFill-Mammo model using different prompt types and configurations (MassTextFill, ClinicalTextFill, RadiomicsFill-MLP, and RadiomicsFill-MET). The table displays the average precision (AP) for mass detection across four categories: low-density benign (L-B), low-density malignant (L-M), high-density benign (H-B), and high-density malignant (H-M).  Additionally, it provides the mean average precision (mAP) at different Intersection over Union (IoU) thresholds (mAP50 and mAP50-95), reflecting overall model performance.", "section": "3.2 How Can RadiomicsFill-Mammo Be Utilized?"}]